Reports/ПлановыеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ПлановыеЗадачи</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/ТипыРасчетаСрокаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаСрокаРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗадачеПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗадачиПроектовСтруктура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектовСтруктура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаннийСтарт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаннийФиниш</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозднийСтарт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозднийФиниш</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суммарная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Comment>Для загрузки из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчетаСрокаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаСрокаРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПлановыеЗадачи/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПланРаботПоЗадачеПроекта( ЗадачаПроекта )
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРабот.Номер
		|ИЗ
		|	Документ.ПланРабот КАК ПланРабот
		|ГДЕ
		|	ПланРабот.ЗадачаПроекта = &ЗадачаПроекта";
	
	Запрос.УстановитьПараметр("ЗадачаПроекта", ЗадачаПроекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Номер;
	КонецЦикла;
	Возврат "";
КонецФункции

&НаСервере
Процедура СформироватьНаСервере( )
	РезультатОтчета.Очистить();
	//Возврат;

	//тзРез = ПолучитьРаботыПоЗадачеПроекта();
	Макет = Отчеты.ПлановыеЗадачи.ПолучитьМакет("Отчет");
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Проект			= ЗадачаПроекта.Владелец.Наименование;
	Обл.Параметры.ПланРабот			= ПланРаботПоЗадачеПроекта( ЗадачаПроекта );
	Обл.Параметры.ПериодОтчета		= ПредставлениеПериода( ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания, "ДЛФ=D");
	
	Обл.Параметры.КлиентМенеджер	= ЗадачаПроекта.Владелец.МенеджерПроекта;
	Обл.Параметры.ДиректорПроекта   = ЗадачаПроекта.Владелец.ДиректорПроекта;
	Обл.Параметры.ТехническийРук	= ЗадачаПроекта.Владелец.Куратор;
	РезультатОтчета.Вывести( Обл );
	
	ВыбСпр = Справочники.ЗадачиПроектовСтруктура.ВыбратьИерархически(,ЗадачаПроекта,,"Код");
	Пока ВыбСпр.Следующий() Цикл
		Если ВыбСпр.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		//Если ВыбСпр.Суммарная 		Тогда
		//	 ДатаОкончания = "";
		//	 
		//	
		//Иначе
			Если ВыбСпр.ТипРасчетаСрокаРаботы = Перечисления.ТипыРасчетаСрокаРабот.ПоЗадачеПроекта Тогда
				НачалоРаботы	= ЗадачаПроекта.НачалоРабот;
				ОкончаниеРаботы = ЗадачаПроекта.ОкончаниеРабот;
			Иначе
				НачалоРаботы 	= ВыбСпр.РаннийСтарт;
				ОкончаниеРаботы = ВыбСпр.ПозднийФиниш;
			КонецЕсли;
			
			Если (ПериодОтчета.ДатаНачала	 <= ОкончаниеРаботы)
			и	 (ПериодОтчета.ДатаОкончания >= НачалоРаботы) Тогда
			// все хорошо	
			Иначе
				Продолжить;
			КонецЕсли;
			 
			
		//КонецЕсли;
		
		Обл = Макет.ПолучитьОбласть("Работа");
		Обл.Параметры.КодСДР 			= СтрЗаменить(ВыбСпр.Ссылка.ПолныйКод(),"/", ".");
		Обл.Параметры.ПрефиксУровня		= СтроковыеФункцииКлиентСервер.ДополнитьСтроку( "", ВыбСпр.УровеньВВыборке()*5, " "); 			
		Обл.Параметры.Работа 			= ВыбСпр.Наименование;
		Обл.Параметры.ОкончаниеРаботы 	= Формат( ОкончаниеРаботы, "ДЛФ=D");
		
		РезультатОтчета.Вывести( Обл );
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подписи");
	РезультатОтчета.Вывести( Обл );
	РезультатОтчета.АвтоМасштаб = Истина;
	РезультатОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗадачаПроекта") Тогда
		ЗадачаПроекта = Параметры.ЗадачаПроекта;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	СформироватьПриОткрытии = Параметры.СформироватьПриОткрытии;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СформироватьПриОткрытии Тогда
		Сформировать("");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	Сформировать("");
КонецПроцедуры
